def 模块_更新内容查看():
    分隔符 = "-" * 100
    版本颜色 = "\033[95m"  # 紫色
    内容颜色 = "\033[92m"  # 亮绿色
    重置颜色 = "\033[0m"

    更新内容 = f"""
{分隔符}
{版本颜色}版本号：1.0.172 ---- 2024年7月12日{重置颜色}
{内容颜色}新增命令：mysql_克隆表单_仅结构(连接对象,源表名,目标表名，#自动递增是否归重置>布尔型，可空<) -->返回一个布尔型：成功返回True，失败返回 False
新增命令：mysql_克隆表单_结构和数据(连接对象,源表名,目标表名)   -->返回一个布尔型：成功返回True，失败返回 False
新增命令：mysql_更新_字段名(连接对象,表名,新字段名列表)   -->返回一个布尔型：成功返回True，失败返回 False
新增命令：mysql_查询_表结构(连接对象,表名)  -->返回一个列表用于存储：结构信息，失败则返回空列表
新增命令：mysql_创建新表(连接对象,表名,结构信息)   -->返回一个布尔型：成功返回True，失败返回 False{重置颜色}
{分隔符}
{版本颜色}版本号：1.0.173 ---- 2024年7月12日{重置颜色}
{内容颜色}新增命令：模块_更新内容查看()    -->无需传递任何参数且没有返回值，默认打印每个版本更新的内容详情{重置颜色}
{分隔符}
{版本颜色}版本号：1.0.174 ---- 2024年7月13日{重置颜色}
{内容颜色}修复已知BUG{重置颜色}
{分隔符}
{版本颜色}版本号：1.0.175 ---- 2024年7月13日{重置颜色}
{内容颜色}修复命令：mysql_更新_字段名(连接对象,表名,新字段名列表)  字符集问题导致无法正常修改的情况{重置颜色}
{分隔符}
{版本颜色}版本号：1.0.176 ---- 2024年7月14日{重置颜色}
{内容颜色}新增命令：邮件IMAP_按日期和发件人搜索邮件(连接对象, 年(int), 月(int), 日(int), 发件人邮箱(str), 条件="SINCE")    -->最后的条件"SINCE"表示条件日期之后的，"BEFORE"表示取之前的
新增命令：邮件IMAP_按日期和主题搜索邮件(连接对象, 年(int), 月(int), 日(int), 主题(str), 条件="SINCE")    -->最后的条件"SINCE"表示条件日期之后的，"BEFORE"表示取之前的{重置颜色}
{分隔符}
{版本颜色}版本号：1.0.185 ---- 2024年7月14日{重置颜色}
{内容颜色}新增命令：
    进程_取命令行(pid)
    进程_取父ID(pid)
    进程_取程序路径(pid)
    进程_取线程数(pid)
    进程_取进程列表()
    进程_取进程启动时间(pid)
    进程_名取ID(进程名)
    进程_名取ID列表(进程名)
    进程_枚举()
    进程_结束PID(pid)
    进程_结束名(进程名){重置颜色}
{分隔符}
{版本颜色}版本号：1.1.0 ---- 2024年7月15日{重置颜色}
{内容颜色}本次更新属于较大调整，对模块内部板块进行调整，优化执行效率。
在保证老的全局调用方式可用的同时，增加独立调用特性。

全局调用使用示例：
import zfx
响应对象 = zfx.网页协议_发送_GET请求("www.baidu.com")
print(响应对象)

独立调用使用示例：
import zfx.网页协议 as 协议
响应对象 = 协议.网页协议_发送_GET请求("www.baidu.com")
print(响应对象){重置颜色}
{分隔符}
{版本颜色}版本号：1.1.3 ---- 2024年7月16日{重置颜色}
{内容颜色}
新增命令：

多进程_创建进程锁()
    - 参数：无
    - 返回：进程锁对象，如果创建成功；None，如果创建失败。

多进程_启动进程(执行体, 参数传递)
    - 参数：执行体（要在子进程中运行的函数），参数传递（传递给函数的参数，必须是元组形式）
    - 返回：进程对象或 None，如果进程启动失败。

多进程_等待进程运行结束_列表(进程对象列表)
    - 参数：进程对象列表（进程对象的列表）
    - 功能：等待列表中的所有进程运行结束。

多进程_进程对象_取PID(进程对象)
    - 参数：进程对象（进程对象）
    - 返回：进程的PID。

多进程_进程对象_取名称(进程对象)
    - 参数：进程对象（进程对象）
    - 返回：进程的名称。

多进程_进程对象_取退出代码(进程对象)
    - 参数：进程对象（进程对象）
    - 返回：进程的退出代码。

多进程_进程对象_检查是否运行(进程对象)
    - 参数：进程对象（进程对象）
    - 返回：True 如果进程正在运行，False 如果未运行或发生异常。

多进程_进程对象_等待结束(进程对象)
    - 参数：进程对象（进程对象）
    - 功能：等待进程对象结束。

多进程_进程对象_终止进程(进程对象)
    - 参数：进程对象（进程对象）
    - 返回：True 如果成功终止进程，False 如果终止进程失败或进程对象无效。

多进程_队列_创建(最大容量=0)
    - 参数：最大容量（int，队列的最大容量。默认为0，表示无限容量）
    - 返回：多进程队列对象，如果创建成功；None，如果创建失败。

多进程_队列_取出(多进程队列对象, 超时=None)
    - 参数：多进程队列对象，超时（int，等待时间（秒），默认为None表示无限等待）
    - 返回：取出的元素，如果成功；None，如果队列为空或取出失败。

多进程_队列_放入(多进程队列对象, item, 超时=None)
    - 参数：多进程队列对象，item（要放入队列的元素），超时（int，等待时间（秒），默认为None表示无限等待）
    - 返回：True 如果成功放入队列；False 如果放入失败。

多进程_队列_是否满(多进程队列对象)
    - 参数：多进程队列对象
    - 返回：True 如果队列已满；False 如果队列未满或发生异常。

多进程_队列_是否空(多进程队列对象)
    - 参数：多进程队列对象
    - 返回：True 如果队列为空；False 如果队列不为空或发生异常。{重置颜色}
{分隔符}
"""
    print(更新内容)
