Repository: pypi-data/pypi-mirror-285
Catalog: packages/mds-cashbook-report/mds_cashbook_report-7.0.11-py3-none-any.whl/trytond/modules/cashbook_report/locale/*.po
Languages: de

# model:ir.message,text:msg_name_cashbook
source: Type of evaluation must be '%(typename)s'.
de: Typ der Auswertung mus '%(typename)s' sein.

# model:ir.message,text:msg_dtype_cashbooks
source: Cashbooks [Amount]
de: Kassenbücher [Betrag]

# model:ir.message,text:msg_dtype_cashbooks_gldiff
source: Cashbooks [Amount of Profit/Loss]
de: Kassenbücher [Betrag Gewinn/Verlust]

# model:ir.message,text:msg_dtype_cashbooks_glperc
source: Cashbooks [Percent of Profit/Loss]
de: Kassenbücher [Prozent Gewinn/Verlust]

# model:ir.message,text:msg_dtype_cashbooks_glvalue
source: Cashbooks [Current Value]
de: Kassenbücher [aktueller Wert]

# model:ir.message,text:msg_dtype_cashbooks_glyield
source: Cashbooks [Total Yield]
de: Kassenbücher [Gesamtertrag]

# model:ir.message,text:msg_dtype_types
source: Types of Cashbooks [Amount]
de: Typen von Kassenbüchern [Betrag]

# model:ir.message,text:msg_dtype_types_gldiff
source: Types of Cashbooks [Amount of Profit/Loss]
de: Typen von Kassenbüchern [Betrag Gewinn/Verlust]

# model:ir.message,text:msg_dtype_types_glvalue
source: Types of Cashbooks [Current Value]
de: Typen von Kassenbüchern [aktueller Wert]

# model:ir.message,text:msg_dtype_types_glperc
source: Types of Cashbooks [Percent of Profit/Loss]
de: Typen von Kassenbüchern [Prozent Gewinn/Verlust]

# model:ir.message,text:msg_dtype_types_glyield
source: Types of Cashbooks [Total Yield]
de: Typen von Kassenbüchern [Gesamtertrag]

# model:ir.message,text:msg_dtype_currencies
source: Currencies
de: Währungen

# model:ir.message,text:msg_dtype_categories
source: Categories [Amount]
de: Kategorien [Betrag]

# model:ir.message,text:msg_dtype_categories_gldiff
source: Categories [Amount of Profit/Loss]
de: Kategorien [Betrag Gewinn/Verlust]

# model:ir.message,text:msg_dtype_categories_glvalue
source: Categories [Current Value]
de: Kategorien [aktueller Wert]

# model:ir.message,text:msg_dtype_categories_glperc
source: Categories [Percent of Profit/Loss]
de: Kategorien [Prozent Gewinn/Verlust]

# model:ir.message,text:msg_dtype_categories_glyield
source: Categories [Total Yield]
de: Kategorien [Gesamtertrag]

# model:ir.message,text:msg_name_graph
source: Graph: %(gname)s
de: Diagramm: %(gname)s

# model:ir.message,text:msg_not_same_basetype
source: Type of evaluation must be of the same base type like '%(typename)s'.
de: Die Art der Auswertung muss vom gleichen Basistyp wie '%(typename)s' sein.

# model:ir.message,text:msg_no_pie_with_dtype2
source: The pie display cannot be used by multiple data sources in the evaluation '%(evalname)s'.
de: Die Tortendarstellung kann nicht mehreren Datenquellen verwendet werden, in der Auswertung '%(evalname)s'.

# model:ir.rule.group,name:rg_eval_write_adm
source: Administrators: Evaluation read/write
de: Administratoren: Auswertung schreiben

# model:ir.rule.group,name:rg_eval_rw_owner
source: Owners: Evaluation read/write
de: Eigentümer: Auswertung schreiben

# model:ir.rule.group,name:rg_eval_companies
source: User in companies
de: Benutzer im Unternehmen

# model:ir.ui.menu,name:menu_evaluation
source: Evaluation
de: Auswertung

# model:cashbook_report.eval_line,name:
source: Evaluation Line Relation
de: Auswertung Zeile Verknüpfung

# field:cashbook_report.eval_line,evaluation:
source: Evaluation
de: Auswertung

# field:cashbook_report.eval_line,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook_report.eval_line,dtype:
source: Data type
de: Datenart

# field:cashbook_report.eval_line,currency:
source: Currency
de: Währung

# field:cashbook_report.eval_line,eval_currency:
source: Currency
de: Währung

# field:cashbook_report.eval_line,currency_digits:
source: Currency Digits
de: Nachkommastellen Währung

# field:cashbook_report.eval_line,eval_dtype1:
source: Data type 1
de: Datenart 1

# field:cashbook_report.eval_line,eval_dtype2:
source: Data type 2
de: Datenart 2

# field:cashbook_report.eval_line,eval_dtype3:
source: Data type 3
de: Datenart 3

# field:cashbook_report.eval_line,eval_dtype4:
source: Data type 4
de: Datenart 4

# field:cashbook_report.eval_line,eval_dtype5:
source: Data type 5
de: Datenart 5

# field:cashbook_report.eval_line,value1:
source: Value 1
de: Wert 1

# field:cashbook_report.eval_line,value2:
source: Value 2
de: Wert 2

# field:cashbook_report.eval_line,value3:
source: Value 3
de: Wert 3

# field:cashbook_report.eval_line,value4:
source: Value 4
de: Wert 4

# field:cashbook_report.eval_line,value5:
source: Value 5
de: Wert 5

# model:cashbook_report.evaluation,name:
source: Evaluation
de: Auswertung

# view:cashbook_report.evaluation:
source: Chart
de: Diagramm

# view:cashbook_report.evaluation:
source: Settings
de: Einstellungen

# view:cashbook_report.evaluation:
source: Representation
de: Darstellung

# view:cashbook_report.evaluation:
source: Type of data displayed
de: Art der dargestellten Daten

# field:cashbook_report.evaluation,dtype1:
source: Data type 1
de: Datenart 1

# help:cashbook_report.evaluation,dtype1:
source: Type of data displayed
de: Art der dargestellten Daten

# field:cashbook_report.evaluation,dtype2:
source: Data type 2
de: Datenart 2

# help:cashbook_report.evaluation,dtype2:
source: Type of data displayed
de: Art der dargestellten Daten

# field:cashbook_report.evaluation,dtype3:
source: Data type 3
de: Datenart 3

# help:cashbook_report.evaluation,dtype3:
source: Type of data displayed
de: Art der dargestellten Daten

# field:cashbook_report.evaluation,dtype4:
source: Data type 4
de: Datenart 4

# help:cashbook_report.evaluation,dtype4:
source: Type of data displayed
de: Art der dargestellten Daten

# field:cashbook_report.evaluation,dtype5:
source: Data type 5
de: Datenart 5

# help:cashbook_report.evaluation,dtype5:
source: Type of data displayed
de: Art der dargestellten Daten

# field:cashbook_report.evaluation,chart:
source: Chart type
de: Diagrammtyp

# help:cashbook_report.evaluation,chart:
source: Type of graphical presentation.
de: Art der grafischen Darstellung.

# selection:cashbook_report.evaluation,chart:
source: Pie
de: Torte

# selection:cashbook_report.evaluation,chart:
source: Line
de: Linie

# selection:cashbook_report.evaluation,chart:
source: Vertical Bars
de: Senkrechte Balken

# selection:cashbook_report.evaluation,chart:
source: Horizontal Bars
de: waagerechte Balken

# field:cashbook_report.evaluation,legend:
source: Legend
de: Legende

# field:cashbook_report.evaluation,maincolor:
source: Color scheme
de: Farbschema

# help:cashbook_report.evaluation,maincolor:
source: The color scheme determines the hue of all components of the chart.
de: Das Farbschema bestimmt den Farbton aller Komponenten des Diagramms.

# selection:cashbook_report.evaluation,maincolor:
source: Default
de: Standard

# selection:cashbook_report.evaluation,maincolor:
source: Red
de: Rot

# selection:cashbook_report.evaluation,maincolor:
source: Green
de: Grün

# selection:cashbook_report.evaluation,maincolor:
source: Grey
de: Grau

# selection:cashbook_report.evaluation,maincolor:
source: Black
de: Schwarz

# selection:cashbook_report.evaluation,maincolor:
source: Dark Cyan
de: Dunkel Cyan

# field:cashbook_report.evaluation,bgcolor:
source: Background Color
de: Hintergrundfarbe

# help:cashbook_report.evaluation,bgcolor:
source: Background color of the chart area. (hex number, e.g. #ffffc0)
de: Hintergrundfarbe der Diagrammfläche. (Hexzahl, z.B. #ffffc0)

# field:cashbook_report.evaluation,posted:
source: Posted
de: Festgeschrieben

# help:cashbook_report.evaluation,posted:
source: Posted amounts only.
de: Nur festgeschriebene Beträge.

# field:cashbook_report.evaluation,cashbooks:
source: Cashbooks
de: Kassenbücher

# field:cashbook_report.evaluation,types:
source: Types
de: Typen

# field:cashbook_report.evaluation,currencies:
source: Currencies
de: Währungen

# field:cashbook_report.evaluation,categories:
source: Categories
de: Kategorien

# field:cashbook_report.evaluation,line_values:
source: Line Values
de: Zeilenwerte

# field:cashbook_report.evaluation,currency:
source: Currency
de: Währung

# model:cashbook_report.evaluation.context,name:
source: Evaluation Context
de: Auswertung Kontext

# field:cashbook_report.evaluation.context,evaluation:
source: Evaluation
de: Auswertung
