Repository: pypi-data/pypi-mirror-285
Catalog: packages/rer.externalnews/rer.externalnews-1.1.1-py3-none-any.whl/rer/externalnews/locales/*/LC_MESSAGES/rer.externalnews.po
Languages: it

source: Edit
it: Modifica

source: ExternalNews
it: Notizia esterna

source: Info
it: Informazioni

source: Install the rer.externalnews add-on.
it: Installa il prodotto rer.externalnews.

source: RER: External News (unistall)
it: RER: External News (disinstalla)

source: Uninstall the rer.externalnews add-on.
it: Disinstalla il prodotto rer.externalnews.

source: View
it: Vista

source: link_address
it: L'indirizzo del collegamento è:

source: link_source
it: Fonte:

source: message_permissions_blocking_link_redirect
it: Vedi questa pagina perché hai il permesso di modificare questo collegamento. Gli altri verranno reindirizzati direttamente all'URL di destinazione del collegamento.

source: rer_ernews_externalurl_help
it: Inserire un link valido ad una risorsa esterna.

source: rer_externalnews_externalsource
it: Fonte

source: rer_externalnews_externalsource_help
it: Da dove proviene questo URL.

source: rer_externalnews_externalurl
it: URL esterno
